; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image5 - mode
	thermograph2 - mode
	image0 - mode
	infrared4 - mode
	infrared1 - mode
	image3 - mode
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star0 - direction
	GroundStation1 - direction
	Star6 - direction
	Star4 - direction
	Star3 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph2)
	(supports instrument1 image0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star0)
	(supports instrument2 image3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star6)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument4 infrared4)
	(calibration_target instrument4 Star3)
	(supports instrument5 image5)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
)
(:goal (and
	(pointing satellite2 Planet11)
	(have_image Phenomenon8 image0)
	(have_image Phenomenon8 infrared1)
	(have_image Planet9 image3)
	(have_image Planet9 infrared4)
	(have_image Phenomenon10 infrared1)
	(have_image Planet11 image0)
	(have_image Star12 image0)
	(have_image Star12 infrared1)
	(have_image Phenomenon13 image3)
	(have_image Planet14 infrared1)
))

)

; plan
1. (turn_to satellite1 groundstation1 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 11
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 11
3. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 11
4. (turn_to satellite1 planet9 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet9)
   goals met: 0 of 11
5. (take_image satellite1 planet9 instrument2 image3)
   added: (have_image planet9 image3)
   goals met: 1 of 11
6. (turn_to satellite1 phenomenon13 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 11
7. (take_image satellite1 phenomenon13 instrument2 image3)
   added: (have_image phenomenon13 image3)
   goals met: 2 of 11
8. (turn_to satellite1 star0 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star0)
   goals met: 2 of 11
9. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 2 of 11
10. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 11
11. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 2 of 11
12. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 2 of 11
13. (turn_to satellite1 phenomenon10 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 11
14. (take_image satellite1 phenomenon10 instrument1 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 3 of 11
15. (turn_to satellite1 phenomenon8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 11
16. (take_image satellite1 phenomenon8 instrument1 image0)
   added: (have_image phenomenon8 image0)
   goals met: 4 of 11
17. (take_image satellite1 phenomenon8 instrument1 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 5 of 11
18. (turn_to satellite1 planet11 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet11)
   goals met: 5 of 11
19. (take_image satellite1 planet11 instrument1 image0)
   added: (have_image planet11 image0)
   goals met: 6 of 11
20. (turn_to satellite1 planet14 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet14)
   goals met: 6 of 11
21. (take_image satellite1 planet14 instrument1 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 7 of 11
22. (turn_to satellite1 star12 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star12)
   goals met: 7 of 11
23. (take_image satellite1 star12 instrument1 image0)
   added: (have_image star12 image0)
   goals met: 8 of 11
24. (take_image satellite1 star12 instrument1 infrared1)
   added: (have_image star12 infrared1)
   goals met: 9 of 11
25. (turn_to satellite2 star3 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star3)
   goals met: 9 of 11
26. (calibrate satellite2 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 9 of 11
27. (turn_to satellite2 planet9 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet9)
   goals met: 9 of 11
28. (take_image satellite2 planet9 instrument4 infrared4)
   added: (have_image planet9 infrared4)
   goals met: 10 of 11
29. (turn_to satellite2 planet11 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet11)
   goals met: 11 of 11
